#### WallpaintApplicationType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "WallpaintApplication" from the "WallPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum WallpaintApplicationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WallpaintApplicationType ``` |

| Visual C++ |
| --- |
| ``` public enum class WallpaintApplicationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Roller |  |
| Brush |  |
| Spray |  |

# See Also

Autodesk.Revit.DB.Visual Namespace